#1)How do you declare a variabe named "name" and assing value "john" to it...?

In [1]:
name="john"
print (name)

john

In [ ]:
#2)write python code to load csv...?

In [5]:
import pandas as pd 
import numpy as np

In [7]:
data=pd.read_csv("data.csv")

In [ ]:
#3)display last 5 rows...?

In [9]:
data.tail()

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
11284,2024-12-18 00:00:00-05:00,20.480000,20.580000,19.209999,19.299999,86041200,0.0,0.0
11285,2024-12-19 00:00:00-05:00,19.530001,19.690001,19.030001,19.059999,69117800,0.0,0.0
11286,2024-12-20 00:00:00-05:00,18.969999,19.760000,18.900000,19.520000,108453700,0.0,0.0
11287,2024-12-23 00:00:00-05:00,19.580000,20.230000,19.520000,20.200001,57988400,0.0,0.0
11288,2024-12-24 00:00:00-05:00,20.219999,20.400000,19.959999,20.400000,29884000,0.0,0.0

In [ ]:
#4)what function is used to fill missing (null) values...?

In [59]:
data=data.fillna(name)

In [ ]:
#5)write python ode to caculate median...?

In [27]:
data ["High"].median

<bound method Series.median of 0         0.184404
1         0.182952
2         0.187308
3         0.186581
4         0.180048
           ...
11284    20.580000
11285    19.690001
11286    19.760000
11287    20.230000
11288    20.400000
Name: High, Length: 11289, dtype: float64>

In [ ]:
#6)write code to calculate mean...?

In [23]:
data ["High"].mean()

15.18589170801116

In [ ]:
#7)how do u drop all rows duplicate...?

In [39]:
data=data.drop_duplicates(("High"))

In [ ]:
#8)what is key difference...?

In [71]:
list1=[1,2,3]
list2=[2,3,4]
list=list1+list2
print(list)

[1, 2, 3, 2, 3, 4]

In [75]:
arr=np.array([[1,3],[2,7]
sum_arr=np.sum(arr
print(array)

[1, 2, 3, 2, 3, 4]

In [ ]:
#9)how do you check nmber of rows and column in dataframes...?

In [43]:
data.shape

(9923, 8)

In [ ]:
#10)what functin is used to identify missing (null)values in data frames...?

In [45]:
data.isnull()

        Date   Open   High    Low  Close  Volume  Dividends  Stock Splits
0      False  False  False  False  False   False      False         False
1      False  False  False  False  False   False      False         False
2      False  False  False  False  False   False      False         False
3      False  False  False  False  False   False      False         False
4      False  False  False  False  False   False      False         False
...      ...    ...    ...    ...    ...     ...        ...           ...
11283  False  False  False  False  False   False      False         False
11284  False  False  False  False  False   False      False         False
11286  False  False  False  False  False   False      False         False
11287  False  False  False  False  False   False      False         False
11288  False  False  False  False  False   False      False         False

[9923 rows x 8 columns]

In [ ]:
#11)how do you count total no of null values in dataframes...?

In [49]:
data.duplicated().sum()

0

In [ ]:
#12)write method find duplicate rows in data frames ...?

In [47]:
data.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
11283    False
11284    False
11286    False
11287    False
11288    False
Length: 9923, dtype: bool